Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions.aPositions Property
 The position types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList aPositions { get; }
Public ReadOnly Property aPositions As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace